// пустой массив
let arr = [];

// массив с тремя числовыми элементами;
let arrNumb = [1, 2, 3];

// массив с тремя строковыми элементами;
let arrStr = ['one', 'two', 'five'];

// массив с тремя строковыми и с тремя числовыми элементами;
let arrCombo = [1, 2, 3, 'one', 'two', 'five'];

// массив с именами всех твоих одногруппников;
let namesGroupMemb = ['Islam', 'Mansur', 'Alikhan'];

// массив, в котором есть число, строка, null, undefined, true и false;
let ultraComboArray = [1, 'lorem', null, undefined, true, false];

// массив, внутри которого три пустых массива;
let array = [
    [],
    [],
    []
];

// массив, внутри которого два массива, а внутри каждого вложенного массива любые три числа.
let numbersArr = [
    [1, 2, 3],
    [4, 5, 6]
];